# index.js
Goat.newVersionDetected=আপনি ভার্সন %1 ব্যবহার করছেন, সর্বশেষ ভার্সন হলো %2। অনুগ্রহ করে আপডেট করুন। কনসোল/সিএমডি-তে এই কমান্ডটি লিখুন: %3
Goat.autoRestart1=বট %1 এর মধ্যে স্বয়ংক্রিয়ভাবে পুনরায় চালু হবে
Goat.autoRestart2=ক্রন জব অনুযায়ী বট স্বয়ংক্রিয়ভাবে পুনরায় চালু হবে: %1
Goat.googleApiTokenExpired=Google API রিফ্রেশ টোকেনের মেয়াদ শেষ হয়েছে বা বাতিল করা হয়েছে, অনুগ্রহ করে https://developers.google.com/oauthplayground/ থেকে একটি নতুন টোকেন নিন

# bot/login/login.js
login.currentlyLogged=লগইন প্রক্রিয়াধীন
login.notFoundDirAccount=ফাইল %1 খুঁজে পাওয়া যায়নি
login.loginToken=অ্যাক্সেস টোকেন দিয়ে লগইন করুন
login.loginCookieString=কুকি স্ট্রিং দিয়ে লগইন করুন
login.loginCookieNetscape=নেটস্কেপ কুকি দিয়ে লগইন করুন
login.loginCookieArray=কুকি অ্যারে দিয়ে লগইন করুন
login.loginPassword=ইমেল ও পাসওয়ার্ড দিয়ে লগইন...
login.accountError=অনুগ্রহ করে %1 ফর্ম্যাটে সম্পূর্ণ অনুমতি সম্পন্ন টোকেন অথবা %2 ফর্ম্যাটে স্ট্রিং কুকি অথবা নিচের ফর্ম্যাটে অ্যারে কুকি লিখুন:\n[\n  { name: %3, value: %4 },\n  { name: %5, value: %6 }\n]\n অথবা\n[\n  { key: %3, value: %4 },\n  { key: %5, value: %6 }\n]\nফাইল %7 এর ভিতর
login.cannotFindAccount=কোনো ফেসবুক অ্যাকাউন্ট খুঁজে পাওয়া যায়নি, নিচের অপশনগুলি থেকে বেছে নিন (নির্বাচন করতে নম্বর লিখুন অথবা উপরে/নিচে তীর চিহ্ন ব্যবহার করে নির্বাচন করুন এবং এন্টার চাপুন):
login.chooseAccount=ইমেল ও পাসওয়ার্ড দিয়ে লগইন
login.chooseToken=সম্পূর্ণ অনুমতি সম্পন্ন টোকেন দিয়ে লগইন
login.chooseCookieString=কুকি স্ট্রিং দিয়ে লগইন
login.chooseCookieArray=কুকি অ্যারে দিয়ে লগইন
login.loginWith=আপনি %1 নির্বাচন করেছেন
login.inputEmail=> অনুগ্রহ করে আপনার ফেসবুক অ্যাকাউন্টের ইমেল (আইডি) বা ফোন নম্বর দিন:
login.inputPassword=> অনুগ্রহ করে আপনার পাসওয়ার্ড দিন:
login.input2FA=> অনুগ্রহ করে 2FA কোড দিন (2FA চালু না থাকলে ফাঁকা রাখুন):
login.inputToken=> অনুগ্রহ করে আপনার সম্পূর্ণ অনুমতি সম্পন্ন টোকেন দিন (EAAAA দিয়ে শুরু):
login.inputCookieString=> অনুগ্রহ করে আপনার কুকি স্ট্রিং দিন:
login.inputCookieArray=> অনুগ্রহ করে আপনার কুকি অ্যারে দিন:
login.refreshCookie=কুকি রিফ্রেশ করা হচ্ছে...
login.refreshCookieError=কুকি রিফ্রেশ করতে একটি ত্রুটি ঘটেছে
login.refreshCookieSuccess=কুকি সফলভাবে রিফ্রেশ করা হয়েছে, নতুন কুকি ব্যবহার করতে বট পুনরায় চালু করুন
login.refreshCookieWarning=আপনি স্বয়ংক্রিয় কুকি রিফ্রেশ মোড সক্রিয় করেছেন, কিন্তু আপনি config.json ফাইলে ইমেল এবং পাসওয়ার্ড কনফিগার করেননি
login.tokenError=টোকেনটি অবৈধ বা মেয়াদোত্তীর্ণ। অনুগ্রহ করে %1 ফর্ম্যাটে সম্পূর্ণ অনুমতি সম্পন্ন টোকেন %2 ফাইলের ভিতর লিখুন
login.cookieError=কুকিটি অবৈধ বা মেয়াদোত্তীর্ণ।
login.loginPasswordError=config.json-এ ইমেল ও পাসওয়ার্ড দিয়ে লগইন করার সময় একটি ত্রুটি ঘটেছে
login.loginSuccess=লগইন সফল হয়েছে
login.loginError=সাইন ইন করার সময় একটি ত্রুটি ঘটেছে
login.openDashboardSuccess=বট ব্যবস্থাপনা পৃষ্ঠা সফলভাবে খোলা হয়েছে
login.openDashboardError=বট ব্যবস্থাপনা পৃষ্ঠা খোলার সময় একটি ত্রুটি ঘটেছে
login.changeGbanData=ডেটা পরিবর্তন করা হয়েছে, বর্তমানে বট চালু করা অসম্ভব
login.errorNoti=বার্তা পাওয়ার সময় একটি ত্রুটি ঘটেছে
login.refreshFbstateSuccess=%1 ফাইল রিফ্রেশ করা হয়েছে
login.refreshFbstateError=%1 ফাইল রিফ্রেশ করার সময় একটি ত্রুটি ঘটেছে
login.youAreBanned=আপনাকে Goat-Bot প্রকল্প থেকে নিষিদ্ধ করা হয়েছে
login.runBot=বট সফলভাবে চালু হয়েছে, ব্যবহারকারীদের কাছ থেকে বার্তা গ্রহণ শুরু হয়েছে
login.notLoggedIn=একটি ত্রুটি ঘটেছে, অনুগ্রহ করে আপনার ফেসবুক অ্যাকাউন্ট আবার পরীক্ষা করুন
login.callBackError=কলব্যাক listenMqtt-এ একটি ত্রুটি ঘটেছে
login.userBanned=আপনাকে বট ব্যবহার থেকে নিষিদ্ধ করা হয়েছে!!
login.checkGbanError=GBAN চেক করার সময় একটি ত্রুটি ঘটেছে, সর্বশেষ ভার্সনে সোর্স আপডেট করার চেষ্টা করুন (cmd খুলে node update লিখুন)
login.gbanMessage=আপনি %1 তারিখে Goat-Bot প্রকল্প থেকে নিষিদ্ধ হয়েছেন, কারণ: %2\n» সময়: %3
login.gbanMessageToDate=আপনি %1 তারিখে Goat-Bot প্রকল্প থেকে নিষিদ্ধ হয়েছেন, কারণ: %2\n» সময়: %3\n» শেষ তারিখ: %4
login.gbanAdminMessage=ব্যবহারকারী %1 %2 তারিখে Goat-Bot প্রকল্প থেকে নিষিদ্ধ হয়েছেন, কারণ: %3
login.openServerUptimeSuccess=🚀 আপটাইম সার্ভার খোলা হয়েছে: %1
login.openServerUptimeError=একটি ত্রুটি ঘটেছে, সার্ভার আপটাইম খোলা যাচ্ছে না
login.restartListenMessage=ListenMQTT পুনরায় চালু করা প্রতি %1 এ সক্রিয় করা হয়েছে
login.stopRestartListenMessage=ListenMQTT পুনরায় চালু করা নিষ্ক্রিয় করা হয়েছে
login.restartListenMessageError=ListenMQTT পুনরায় চালু করার সময় একটি ত্রুটি ঘটেছে
login.restartListenMessage2=ListenMQTT সফলভাবে পুনরায় চালু করা হয়েছে
login.refreshCookieAfter=%1 পরে কুকি রিফ্রেশ করা হচ্ছে
login.listenMqttClose=ListenMQTT বন্ধ হয়েছে
login.listenMqttCloseByUser=ListenMQTT ব্যবহারকারী দ্বারা বন্ধ করা হয়েছে
login.retryCheckLiveCookie=কুকি চেক করার জন্য পুনরায় চেষ্টা করা হচ্ছে... %1
login.startBotSuccess=বট সফলভাবে শুরু হয়েছে, ব্যবহারকারীদের কাছ থেকে বার্তা গ্রহণ শুরু হয়েছে

version.tooOldVersion=আপনি Goat-Bot-এর একটি অত্যধিক পুরোনো ভার্সন ব্যবহার করছেন, অনুগ্রহ করে সর্বশেষ ভার্সনে আপডেট করতে cmd/console/terminal/shell-এ এই কমান্ডটি লিখুন: %1

# bot/custom.js
custom.refreshedFb_dtsg=fb_dtsg এবং jazoest সফলভাবে রিফ্রেশ করা হয়েছে
custom.refreshedFb_dtsgError=fb_dtsg এবং jazoest রিফ্রেশ করার সময় একটি ত্রুটি ঘটেছে

# bot/login/loadData.js
loadData.loadThreadDataSuccess=%1 টি গ্রুপের ডেটা সফলভাবে লোড হয়েছে!
loadData.loadUserDataSuccess=%1 জন ব্যবহারকারীর ডেটা সফলভাবে লোড হয়েছে!
loadData.refreshingThreadData=গ্রুপগুলোর তথ্য হালনাগাদ করা হচ্ছে...
loadData.refreshThreadDataSuccess=%1 টি গ্রুপের তথ্য হালনাগাদ করা হয়েছে!
loadData.refreshThreadDataError=গ্রুপগুলোর তথ্য হালনাগাদ করতে গিয়ে কিছু সমস্যা হয়েছে!

# bot/login/loadScripts.js
loadScripts.loadScriptsError=%1 ফাইল লোড করার সময় একটি ত্রুটি ঘটেছে:
loadScripts.loadScriptsNotMatchOrigin=%1 ফাইলগুলি গিটহাব প্রকল্পের মূল ফাইলের সাথে মেলে না, নিশ্চিত করুন যে এই কমান্ড ফাইলগুলি নির্ভরযোগ্য:
loadScripts.NOT_FOUND=মূল সোর্স কোডে পাওয়া যায়নি:
loadScripts.NOT_MATCH=মূল সোর্স কোডের সাথে মেলে না:

# bot/login/socketIO.js
socketIO.connected=socket.io সার্ভারে সংযুক্ত হয়েছে
socketIO.error=socket.io সার্ভারে সংযোগ করার সময় একটি ত্রুটি ঘটেছে

# bot/handler/handlerCheckData.js
handlerCheckData.cantCreateThread='%1' আইডি বিশিষ্ট গ্রুপ ডাটাবেসে লেখা যাবে না!
handlerCheckData.cantCreateUser='%1' আইডি বিশিষ্ট ব্যবহারকারী ডাটাবেসে লেখা যাবে না!

# bot/handler/handlerEvents.js
# bot/handler/handlerEvents.js
handlerEvents.userBanned=❌ নিষিদ্ধ! আপনি বট ব্যবহার করতে পারবেন না!\n────────────────\n» কারণ: %1\n» সময়: %2\n» ব্যবহারকারী আইডি: %3\n────────────────
handlerEvents.threadBanned=❌� নিষিদ্ধ! এই গ্রুপ বট ব্যবহার করতে পারবে না!\n────────────────\n» কারণ: %1\n» সময়: %2\n» গ্রুপ আইডি: %3\n────────────────
handlerEvents.onlyAdminBox=⚠️ শুধু গ্রুপ অ্যাডমিনরা এই গ্রুপে বট ব্যবহার করতে পারবেন।
handlerEvents.onlyAdminBot=⚠️ শুধু বট অ্যাডমিনদের জন্য!\n» আপনি এই কমান্ড ব্যবহার করতে পারবেন না।
handlerEvents.commandNotFound=⚠️ কমান্ড খুঁজে পাওয়া যায়নি!\n» সব কমান্ড দেখতে %1help টাইপ করুন 👾
handlerEvents.commandNotFound2=⚪ শুধু প্রিফিক্স সহ ব্যবহার যোগ্য!\n» উপলব্ধ কমান্ড দেখতে %1help টাইপ করুন 🛠️
handlerEvents.commandSyntaxError=⚠️ ভুল সিনট্যাক্স!\n» সঠিক ব্যবহার দেখতে %1help %2 ব্যবহার করুন।
handlerEvents.onlyAdmin=⚠️ শুধু গ্রুপ অ্যাডমিনরা "%1" ব্যবহার করতে পারবেন।
handlerEvents.onlyAdminToUseOnReply=🛡️ "%1" রিপ্লাই ফাংশনের জন্য শুধু অ্যাডমিনদের অনুমতি রয়েছে।
handlerEvents.onlyAdminToUseOnReaction=🛡️ "%1" রিঅ্যাকশনের জন্য শুধু অ্যাডমিনদের অনুমতি রয়েছে।
handlerEvents.onlyAdminBot2=⚠️ শুধু বট অ্যাডমিন: "%1"।
handlerEvents.onlyAdminBot2ToUseOnReply=⚠️ শুধু বট অ্যাডমিন রিপ্লাই: "%1"।
handlerEvents.onlyAdminBot2ToUseOnReaction=⚠️ শুধু বট অ্যাডমিন রিঅ্যাক্ট: "%1"।
handlerEvents.waitingForCommand=⏳ দয়া করে %1 সেকেন্ড অপেক্ষা করুন এই কমান্ড আবার ব্যবহার করতে।
handlerEvents.errorOccurred=💥 ত্রুটি [ %1 ]\n» "%2" কমান্ডে\n────────────────\n%3
handlerEvents.errorOccurred2=💥 ত্রুটি [ %1 ]\n» "%2" এর onChat এ\n────────────────\n%3
handlerEvents.errorOccurred3=💥 ত্রুটি [ %1 ]\n» "%2" এর onReply তে\n────────────────\n%3
handlerEvents.errorOccurred4=💥 ত্রুটি [ %1 ]\n» "%2" এর onReaction এ\n────────────────\n%3
handlerEvents.errorOccurred5=💥 ত্রুটি [ %1 ]\n» "%2" এর onEvent এ\n────────────────\n%3
handlerEvents.errorOccurred6=💥 ত্রুটি [ %1 ]\n» "%2" এর onEvent এ\n────────────────\n%3
handlerEvents.errorOccurred7=💥 ত্রুটি [ %1 ]\n» "%2" এর onAnyEvent এ\n────────────────\n%3
handlerEvents.cannotFindCommandName=❌ রিপ্লাই এক্সিকিউট করার জন্য কমান্ডের নাম পাওয়া যায়নি!
handlerEvents.cannotFindCommand=❌ রিপ্লাই এক্সিকিউট করার জন্য "%1" কমান্ড পাওয়া যায়নি!

# bot/autoUptime.js
autoUptime.autoUptimeTurnedOn=অটোআপটাইম মোড চালু করা হয়েছে

# database/controller/index.js
indexController.connectingMongoDB=MONGODB ডাটাবেসে সংযোগ করা হচ্ছে
indexController.connectMongoDBSuccess=মংগোডিবি ডাটাবেসে সফলভাবে সংযুক্ত হয়েছে!
indexController.connectMongoDBError=মংগোডিবি ডাটাবেসে সংযোগ করার সময় একটি ত্রুটি ঘটেছে:
indexController.connectingMySQL=SQLITE ডাটাবেসে সংযোগ করা হচ্ছে
indexController.connectMySQLSuccess=SQLITE ডাটাবেসে সফলভাবে সংযুক্ত হয়েছে!
indexController.connectMySQLError=SQLITE ডাটাবেসে সংযোগ করার সময় একটি ত্রুটি ঘটেছে:

# updater.js
updater.updateTooFast=সর্বশেষ কমিটের পরে ত্রুটিমুক্ত আপডেটের জন্য অনুগ্রহ করে কমপক্ষে ৫ মিনিট অপেক্ষা করুন, %1 মিনিট %2 সেকেন্ড বাকি
updater.latestVersion=আপনি সর্বশেষ ভার্সন ব্যবহার করছেন
updater.cantFindVersion=আপনি একটি অনির্ধারিত ভার্সন (%1) ব্যবহার করছেন, অনুগ্রহ করে আপনার package.json ফাইল আবার পরীক্ষা করুন
updater.newVersions=আপডেট করার জন্য %1 টি নতুন ভার্সন রয়েছে, আপডেট শুরু হচ্ছে...
updater.updateSuccess=আপডেট সফল হয়েছে%1
updater.configChanged=%1 পরিবর্তন করা হয়েছে, অনুগ্রহ করে আপনার config.json ফাইল আবার পরীক্ষা করুন
updater.installingPackages=বটের জন্য নির্ভরশীলতা (dependencies) ইনস্টল করা হচ্ছে...
updater.installSuccess=নির্ভরশীলতা সফলভাবে ইনস্টল করা হয়েছে, নতুন ভার্সন ব্যবহার করতে বট পুনরায় চালু করুন
updater.backupSuccess=পরিবর্তিত ফাইলগুলি সফলভাবে ব্যাকআপ করা হয়েছে, %1 ফোল্ডারে দেখুন
updater.restartToApply=. নতুন ভার্সন প্রয়োগ করতে বট পুনরায় চালু করুন
updater.skipFile=%1 ফাইলের একটি নতুন ভার্সন আছে, কিন্তু আপনি এই ফাইলটিতে %2 মন্তব্যের মাধ্যমে আপডেট প্রক্রিয়া চলাকালীন এটি এড়িয়ে গেছেন

# dashboard/routes/verifyfbid.js
verifyfbid.sendCode=আপনার ভেরিফিকেশন কোড হলো:\n%1\nভেরিফিকেশন কোডটি %2 মিনিটের জন্য বৈধ

# utils.js
utils.errorOccurred=❌ একটি ত্রুটি ঘটেছে:\n\n%1

# for command
command.restartedBot=বট পুনরায় চালু করা হয়েছে

# dashboard/app.js
app.googleApiRefreshTokenExpired=Google API রিফ্রেশ টোকেনের মেয়াদ শেষ হয়েছে বা বাতিল করা হয়েছে, অনুগ্রহ করে https://developers.google.com/oauthplayground/ থেকে একটি নতুন টোকেন নিন
app.tooManyRequests=গত মিনিটে অনেকগুলি অনুরোধ পাঠানো হয়েছে। অনুগ্রহ করে পরে আবার চেষ্টা করুন।
app.notPermissionChangeFbstate=আপনার fbstate পরিবর্তন করার অনুমতি নেই!
app.notFoundFbstate=অনুগ্রহ করে fbstate লিখুন!
app.changedFbstateSuccess=সফলভাবে fbstate পরিবর্তন করা হয়েছে!
app.serverError=সার্ভারে একটি ত্রুটি হয়েছে, অনুগ্রহ করে পরে আবার চেষ্টা করুন!
